       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTOMERLOOKUP.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CUSTOMER-ID PIC 9(4).

       PROCEDURE DIVISION.
           display "123".

           STOP RUN.